RedditClone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "posty post"], ["url", ""], ["content", "sdfsdf"], ["sub_id", 10], ["author_id", 15], ["created_at", "2018-09-18 23:40:00.999423"], ["updated_at", "2018-09-18 23:40:00.999423"]]
---
  def create
    @post = Post.new(post_params)
    # @post.sub_id = params[:sub_id]
    @post.author_id = current_user.id

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def require_author
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "url" = $2, "content" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "zgzdg"], ["url", ""], ["content", "dfgdfg"], ["updated_at", "2018-09-18 23:43:48.611472"], ["id", 6]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)