RedditClone/app/controllers/subs_controller.rb

  def show
    @sub = Sub.find(params[:id])
        @subs = Sub.all
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "subs".* FROM "subs"

  def require_moderator
    @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def update
    @sub = Sub.find(params[:id])

    if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Dogs"], ["description", "the best dogs"], ["updated_at", "2018-09-18 22:25:28.186986"], ["id", 7]]